import numpy as np 
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker

plt.rcParams['font.size'] = 16 # Общий размер для всех элементов
plt.rcParams['figure.figsize'] = [8, 8] # Все новые графики будут 8x5 дюймов

T = np.array([210, 600, 800, 1000, 1600, 2200, 2800, 3400, 4000, 4600, 5300, 6000, 6700, 7400, 8100, 8800, 9500, 10200])/1000
C = np.array([0.116198897859155, 0.09632436964533655, 0.0874349394591908, 0.0861787578713447, 0.0820320812667242, 0.08035256996600361, 0.08014746720816358,
               0.07638466189981624, 0.07803898226931237, 0.07945535338142871, 0.0784225020609696, 0.07939911609779485, 0.07919190735204812, 0.07715253290165193,
                 0.07691569539537815, 0.07675128102950372, 0.07703996035647037, 0.07685091558694972])
C_m = np.array([0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.129, 0.128, 0.13, 0.134, 0.136, 0.138 , 0.14, 0.13])/1.5


fix, ax = plt.subplots()
ax.plot(T, C_m, color = "blue", label="модельные значения")
ax.plot(T, C, color = "black", label="эксперимент")
ax.scatter(T, C, color = "black")
ax.yaxis.set_major_locator(ticker.MultipleLocator(0.01))

plt.xlabel("T, [мс]")
plt.ylabel("C")
plt.ylim(0.08, 0.18)
plt.grid()

plt.legend()
plt.show()